### What is NAT
<p align="justify">**Network Address Translation (NAT)** is a process used in routers or firewalls to change the **source or destination IP address** of network packets. This allows multiple devices on a private network to **share a single public IP address** when accessing the internet.</p>
### Types of NAT

### Static NAT
<p align="justify">**Static NAT** is a type of NAT where a **single private IP address** is permanently mapped to a **single public IP address**. This allows a device on a private network (such as a web server) to have a fixed, publicly accessible IP address.</p>

```
Router(config)# ip nat inside source static 192.168.1.10 200.100.100.10
```

### Dynamic NAT
**Dynamic NAT** is a type of NAT where a **private IP address** is temporarily mapped to a **public IP address** from a **pool of available public IPs**. Unlike **Static NAT**, which has a fixed mapping, **Dynamic NAT assigns public IPs dynamically on a first-come, first-served basis**.

#### Define Allowed Private IPs
```
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```
**What it does:**

- **`access-list 1`** â†’ Creates an Access Control List (ACL) with ID 1.
- **`permit 192.168.1.0 0.0.0.255`** â†’ Allows all devices in **192.168.1.x** to use NAT.
#### Create a Pool of Public IPs
```
Router(config)# ip nat pool MYPOOL 200.100.100.10 200.100.100.20 netmask 255.255.255.0
```
**What it does:**

- **`ip nat pool MYPOOL`** â†’ Creates a pool named `MYPOOL`.
- **`200.100.100.10 - 200.100.100.20`** â†’ Defines the range of public IPs.
- **`netmask 255.255.255.0`** â†’ Sets the subnet mask for the pool.
#### Enable NAT Using This Pool
```
Router(config)# ip nat inside source list 1 pool MYPOOL
```
**What it does:**

- **`ip nat inside source list 1`** â†’ Uses ACL 1 (created earlier) to define which private IPs can use NAT.
- **`pool MYPOOL`** â†’ Uses the `MYPOOL` pool for translation.
ðŸ”¹ **Effect:** Private IPs are dynamically assigned a public IP from the pool when they access the internet.
### PAT
<p align="justify">**Port Address Translation (PAT)** is a type of **Network Address Translation (NAT)** that allows multiple devices on a **private network** to access the internet using a **single public IP address**. It does this by **assigning unique port numbers** to each outgoing connection.</p>
#### Define Allowed Private IPs
```
Router(config)# access-list 1 permit 192.168.1.0 0.0.0.255
```
**What it does:**

- Allows all private IPs in **192.168.1.x** to use NAT.
#### Enable PAT Using the Routerâ€™s Public IP
```
Router(config)# ip nat inside source list 1 interface g0/1 overload
```
**What it does:**

- **`ip nat inside source list 1`** â†’ Uses ACL 1 for NAT.
- **`interface g0/1`** â†’ Uses the IP of the WAN interface (public IP) for translation.
- **`overload`** â†’ Enables PAT, allowing multiple private IPs to share a single public IP by assigning different port numbers.

ðŸ”¹ **Effect:** All private IPs in **192.168.1.x** share **one** public IP (e.g., **200.100.100.1**       ) with unique ports.

## NAT Configuration
NAT requires two types of interfaces:

- **Inside Interface:** The interface connected to the private network (LAN).
    
- **Outside Interface:** The interface connected to the public network (Internet)

### Summary of Commands

|**Command**|**Explanation**|
|---|---|
|`ip nat inside`|Marks an interface as an inside (private) network.|
|`ip nat outside`|Marks an interface as an outside (public) network.|
|`ip nat inside source static <private-IP> <public-IP>`|Maps a private IP to a specific public IP (Static NAT).|
|`access-list 1 permit <private-subnet>`|Defines which private IPs can use NAT.|
|`ip nat pool <name> <start-IP> <end-IP> netmask <mask>`|Defines a pool of public IPs (Dynamic NAT).|
|`ip nat inside source list <ACL> pool <name>`|Enables Dynamic NAT using an ACL and pool.|
|`ip nat inside source list <ACL> interface <WAN-interface> overload`|Enables PAT (many-to-one NAT).|
|`show ip nat translations`|Displays active NAT translations.|
|`show ip nat statistics`|Shows NAT usage statistics.|
|`debug ip nat`|Displays real-time NAT translations.|

## Access Control List

### Access Control List 
<p align="justify">An **Access Control List (ACL)** is a set of **rules** used in **network devices (routers, firewalls, etc.)** to control incoming and outgoing traffic. It **filters** packets based on IP addresses, protocols, and ports to **allow or deny access** to specific network resources.</p>

### Types of ACL'S
1. Standard ACL
- A **Standard ACL** is a type of Access Control List in Cisco routers that **filters traffic based only on the source IP address**
2. Extended ACL
- An **Extended ACL** is a type of Access Control List in Cisco routers that **filters traffic based on source & destination IP addresses, protocols (TCP, UDP, ICMP), and port numbers**.

#### **Key ACL Commands**

- `access-list` â†’ Creates an ACL rule.
    
- `permit` â†’ Allows traffic.
    
- `deny` â†’ Blocks traffic.
    
- `ip access-group` â†’ Applies ACL to an interface.
    
- `remark` â†’ Adds a comment to an ACL.
